# Вывести квадрат числа

print('Введите число:')
a = int(input())
print(f'Квадрат числа {a} равен {a**2}')